Reports/ЛБ_РезультатГлобальнойПроверкиПоПеречням.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_РезультатГлобальнойПроверкиПоПеречням</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОЛомбарды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПеречень</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДРЛомбарды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДРПеречень</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МРЛомбарды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МРПеречень</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортЛомбарды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортПеречень</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЛомбарды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПеречень</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатДР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатМР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПаспорт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокПроверок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_КлиентыВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КлиентыВПеречнях</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроверкиПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВключенияВПеречень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКлиентаВПеречне</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыКлиентаВПеречнях</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПереченьНежелательныхЛицДрНаименования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПереченьНежелательныхЛицДрНаименования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТехническоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГодРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЛБ_РезультатГлобальнойПроверкиПоПеречням/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДатаСверки") Тогда
		Отчет.ДатаСверки = Параметры.ДатаСверки;  
	КонецЕсли;    
	Если Параметры.Свойство("ДатаНач") Тогда
		Отчет.ДатаНач = Параметры.ДатаНач;
	КонецЕсли;  
	Если Параметры.Свойство("ДатаКон") Тогда
		Отчет.ДатаКон = Параметры.ДатаКон;
	КонецЕсли;  
	
	СформироватьНаСервере();
КонецПроцедуры  

&НаСервере
Процедура СформироватьНаСервере() Экспорт
	
	ДокументРезультат.Очистить();
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГлобальнаяПроверкаПеречней";

	Макет 			 = Отчет.РеквизитМакет;
	
	ОбластьШапки 	 = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка"); 
	ОбластьПодвал 	 = Макет.ПолучитьОбласть("Подвал");  
	
	ВидыПеречней = Новый СписокЗначений;
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.МВК);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.Террористы);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ФРОМУ);
	ВидыПеречней.Добавить(Перечисления.ЛБ_ВидыПеречней.ООН);
	
	ЗапросК = Новый Запрос; 
	ЗапросК.УстановитьПараметр("ВидыПеречней", ВидыПеречней);
	ЗапросК.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.ДатаНач));
	ЗапросК.УстановитьПараметр("ДатаКон", КонецДня(Отчет.ДатаКон));
	ЗапросК.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_КлиентыВПеречнях.Залогодатель КАК Клиент,
	                |	ЛБ_КлиентыВПеречнях.ВидПеречня КАК ВидПеречня,
	                |	ЛБ_КлиентыВПеречнях.ДатаПеречня КАК ДатаПеречня,
	                |	ЛБ_КлиентыВПеречнях.ИД КАК ИД
	                |ИЗ
	                |	РегистрСведений.ЛБ_КлиентыВПеречнях КАК ЛБ_КлиентыВПеречнях
	                |ГДЕ
	                |	ЛБ_КлиентыВПеречнях.СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)
	                |	И ЛБ_КлиентыВПеречнях.ВидПеречня В(&ВидыПеречней)
	                |	И ЛБ_КлиентыВПеречнях.ВидПроверки = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыПроверкиПеречней.ГлобальнаяПроверка)
	                |	И ЛБ_КлиентыВПеречнях.Период МЕЖДУ &ДатаНач И &ДатаКон
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДатаПеречня УБЫВ";
	ТаблицаЗапроса = ЗапросК.Выполнить().Выгрузить();
    ТаблицаКлиентов = ТаблицаЗапроса.Скопировать();
	ТаблицаКлиентов.Свернуть("ВидПеречня, Клиент, ИД");
			
	ОбластьШапки.Параметры.ДатаСверки = Отчет.ДатаСверки; 
	ОбластьШапки.Параметры.ДатаНач = Формат(Отчет.ДатаНач, "ДФ=dd.MM.yyyy");
	ОбластьШапки.Параметры.ДатаКон = Формат(Отчет.ДатаКон, "ДФ=dd.MM.yyyy");
	ОбластьШапки.Параметры.Кол = ТаблицаКлиентов.Количество(); 
	ДокументРезультат.Вывести(ОбластьШапки);  
	
	Если ТаблицаКлиентов.Количество() = 0 Тогда  
		ОбластьСтрока.Параметры.Ном = 1;
		ДокументРезультат.Вывести(ОбластьСтрока);
		ОбластьПодвал.Параметры.ИнформацияСверки = "Совпадений не выявлено.";
	Иначе   
		Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК Адрес,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия_А КАК Фамилия_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя_А КАК Имя_А,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество_А КАК Отчество_А
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";

		ЗапросДок = Новый Запрос;  
		ЗапросДок.УстановитьПараметр("ВидДокументаЗалогодателя", Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность);
		ЗапросДок.Текст = "ВЫБРАТЬ
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
		                  |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
		                  |	ЛБ_ДокументыЗалогодателя.Наименование КАК Наименование
		                  |ИЗ
		                  |	Справочник.ЛБ_ДокументыЗалогодателя КАК ЛБ_ДокументыЗалогодателя
		                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних КАК ЛБ_ДокументыЗалогодателейСрезПоследних
		                  |		ПО (ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя = ЛБ_ДокументыЗалогодателя.Ссылка)
		                  |ГДЕ
		                  |	ЛБ_ДокументыЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
		                  |	И ЛБ_ДокументыЗалогодателя.Владелец = &Клиент";
						
		//перечни
		ЗапросК1 = Новый Запрос; 
		ЗапросК1.УстановитьПараметр("Статус", Перечисления.ЛБ_СтатусыКлиентаВПеречнях.Включен);
		ЗапросК1.Текст = "ВЫБРАТЬ
		                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Наименование КАК Наименование,
		                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.ДатаРождения КАК ДатаРождения,
		                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.МестоРождения КАК МестоРождения,
		                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.НаименованиеЛат КАК НаименованиеЛат
		                 |ИЗ
		                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛиц.СрезПоследних(
		                 |			,
		                 |			ВидПеречня = &ВидПеречня
		                 |				И ИД = &ИД) КАК ЛБ_ПереченьНежелательныхЛицСрезПоследних
		                 |ГДЕ
		                 |	ЛБ_ПереченьНежелательныхЛицСрезПоследних.Статус = &Статус"; 
		//другие наименования
		ЗапросК2 = Новый Запрос; 		
		ЗапросК2.Текст = "ВЫБРАТЬ
		                 |	ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних.Наименование КАК Наименование
		                 |ИЗ
		                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДрНаименования.СрезПоследних(
		                 |			,
		                 |			ВидПеречня = &ВидПеречня
		                 |				И ИД = &ИД) КАК ЛБ_ПереченьНежелательныхЛицДрНаименованияСрезПоследних";  
		//документы
		ЗапросК3 = Новый Запрос;  		
		ЗапросК3.Текст = "ВЫБРАТЬ
		                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументНаименование КАК Наименование,
		                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументНомер КАК ДокументНомер,
		                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументСерия КАК ДокументСерия,
		                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		                 |	ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи
		                 |ИЗ
		                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицДокументы.СрезПоследних(
		                 |			,
		                 |			ВидПеречня = &ВидПеречня
		                 |				И ИД = &ИД) КАК ЛБ_ПереченьНежелательныхЛицДокументыСрезПоследних"; 
		//адреса
        ЗапросК4 = Новый Запрос; 
		ЗапросК4.Текст = "ВЫБРАТЬ
		                 |	ЛБ_ПереченьНежелательныхЛицАдресаСрезПоследних.Адрес КАК Адрес
		                 |ИЗ
		                 |	РегистрСведений.ЛБ_ПереченьНежелательныхЛицАдреса.СрезПоследних(
		                 |			,
		                 |			ВидПеречня = &ВидПеречня
		                 |				И ИД = &ИД) КАК ЛБ_ПереченьНежелательныхЛицАдресаСрезПоследних";

		
		Ном = 0;
		Для каждого СтрК Из ТаблицаКлиентов Цикл 
			Ном = Ном + 1;
			ОбластьСтрока.Параметры.Ном = Ном;
					
			//заполним таблицу сверки
			Отчет.ТаблицаСверки.Очистить();  
			Запрос.УстановитьПараметр("Клиент", СтрК.Клиент);
			Выборка = Запрос.Выполнить().Выбрать(); 
			Пока Выборка.Следующий() Цикл  
				Наименование = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		        НаименованиеЛат = СокрЛП(Выборка.Фамилия_А) + " " + СокрЛП(Выборка.Имя_А) + ?(НЕ ПустаяСтрока(Выборка.Отчество_А), " " + СокрЛП(Выборка.Отчество_А), "");
			    НоваяСтр = Отчет.ТаблицаСверки.Добавить();
				НоваяСтр.Клиент = СтрК.Клиент; 
				НоваяСтр.ФИОЛомбарды = Наименование; 
				НоваяСтр.ДРЛомбарды = Выборка.ДатаРождения;  
				НоваяСтр.МРЛомбарды = Выборка.МестоРождения;
				НоваяСтр.АдресЛомбарды = Выборка.Адрес;  
				
				Если СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
				    СписокПроверок = "Перечень террористов:";
				ИначеЕсли СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
				    СписокПроверок = "Список МВК:";
				ИначеЕсли СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
				    СписокПроверок = "Перечень ФРОМУ:"; 
				ИначеЕсли СтрК.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ООН Тогда
				    СписокПроверок = "Перечень ООН:";	
	            КонецЕсли;
				ОтборК = Новый структура;
				ОтборК.Вставить("Клиент", СтрК.Клиент);
				ОтборК.Вставить("ИД", СтрК.ИД);
				ОтборК.Вставить("ВидПеречня", СтрК.ВидПеречня);
				
				СтрокиДаты = ТаблицаЗапроса.НайтиСтроки(ОтборК); 
				Если СтрокиДаты.Количество() > 15 Тогда
					КонЧисло = 14;
				Иначе
					КонЧисло = СтрокиДаты.Количество()-1;
				КонецЕсли;	
				Для Сч = 0 По КонЧисло Цикл  
					СписокПроверок = СписокПроверок + ?(сч = 0, " ", ", ") + Формат(СтрокиДаты.Получить(сч).ДатаПеречня, "ДФ=dd.MM.yyyy");
				КонецЦикла;	    
				Если СтрокиДаты.Количество() > 15 Тогда
					сч = СтрокиДаты.Количество()-1;
					СписокПроверок = СписокПроверок + " ..." + Формат(СтрокиДаты.Получить(сч).ДатаПеречня, "ДФ=dd.MM.yyyy");
				КонецЕсли;	
				НоваяСтр.СписокПроверок = СписокПроверок;
				
				ЗапросДок.УстановитьПараметр("Клиент", СтрК.Клиент); 
				ТаблицаДокЛомбарды = ЗапросДок.Выполнить().Выгрузить(); 
				
				ЗапросК1.УстановитьПараметр("ВидПеречня", СтрК.ВидПеречня);
				ЗапросК1.УстановитьПараметр("ИД", СтрК.Ид);   
				Выборка1 = ЗапросК1.Выполнить().Выбрать();
				Если Выборка1.Следующий() Тогда   
					Если Врег(СокрЛП(Наименование)) = Врег(СокрЛП(Выборка1.Наименование)) Тогда
						НоваяСтр.ФИОПеречень = Выборка1.Наименование;
					ИначеЕсли Врег(СокрЛП(НаименованиеЛат)) = Врег(СокрЛП(Выборка1.НаименованиеЛат)) Тогда
						НоваяСтр.ФИОПеречень = Выборка1.НаименованиеЛат; 
			            НоваяСтр.ФИОЛомбарды = НаименованиеЛат;	
					Иначе           
						ЗапросК2.УстановитьПараметр("ВидПеречня", СтрК.ВидПеречня);
						ЗапросК2.УстановитьПараметр("ИД", СтрК.Ид);   
						Выборка2 = ЗапросК2.Выполнить().Выбрать();
						ЕстьРезультат = ложь;
						Пока Выборка1.Следующий() Цикл 
							Если Врег(СокрЛП(Наименование)) = Врег(СокрЛП(Выборка2.Наименование)) Тогда
						        НоваяСтр.ФИОПеречень = Выборка2.Наименование;
								ЕстьРезультат = Истина;   
								Прервать;
							КонецЕсли;
							Если Врег(СокрЛП(НаименованиеЛат)) = Врег(СокрЛП(Выборка2.Наименование)) Тогда
						        НоваяСтр.ФИОПеречень = Выборка2.Наименование;
								НоваяСтр.ФИОЛомбарды = НаименованиеЛат;
								ЕстьРезультат = Истина;   
								Прервать;
		                    КонецЕсли;
						КонецЦикла;  
						Если НЕ ЕстьРезультат Тогда 
							НоваяСтр.ФИОПеречень = Выборка1.Наименование;
						КонецЕсли;	
					КонецЕсли;
					НоваяСтр.ДРПеречень = Выборка1.ДатаРождения;  
				    НоваяСтр.МРПеречень = Выборка1.МестоРождения;
				КонецЕсли;	 
				НоваяСтр.РезультатФИО = ?(ВРег(СокрЛП(НоваяСтр.ФИОЛомбарды)) = ВРег(СокрЛП(НоваяСтр.ФИОПеречень)), "Полное совпадение", "Не совпадает");  
				НоваяСтр.РезультатДР = ?(НоваяСтр.ДРЛомбарды = НоваяСтр.ДРПеречень, "Полное совпадение", "Не совпадает");  
				НоваяСтр.РезультатМР = ?(ВРег(СокрЛП(НоваяСтр.МРЛомбарды)) = ВРег(СокрЛП(НоваяСтр.МРПеречень)), "Полное совпадение", "Не совпадает"); 
				
				ЗапросК3.УстановитьПараметр("ВидПеречня", СтрК.ВидПеречня);
				ЗапросК3.УстановитьПараметр("ИД", СтрК.Ид); 
				ТаблицаДокПеречень = ЗапросК3.Выполнить().Выгрузить(); 
				
				ЗапросК4.УстановитьПараметр("ВидПеречня", СтрК.ВидПеречня);
				ЗапросК4.УстановитьПараметр("ИД", СтрК.Ид); 
				Выборка4 = ЗапросК4.Выполнить().Выбрать(); 
				АдресаПеречень = "";
				Пока Выборка4.Следующий() Цикл  
					АдресаПеречень = ?(ПустаяСтрока(АдресаПеречень), "", Символы.ПС) + СокрЛП(Выборка4.Адрес);
				Конеццикла;
				НоваяСтр.АдресПеречень = АдресаПеречень;  
				НоваяСтр.РезультатАдрес = ?(ВРег(СокрЛП(НоваяСтр.АдресЛомбарды)) = ВРег(СокрЛП(НоваяСтр.АдресПеречень)), "Полное совпадение", "Не совпадает");
				
				ЕстьРезультат = ложь;
				Для каждого СтрДок Из ТаблицаДокЛомбарды Цикл
					ОтборДок = Новый Структура;
					ОтборДок.Вставить("ДокументСерия", СокрЛП(СтрДок.ДокументСерия)); 
					ОтборДок.Вставить("ДокументНомер", СокрЛП(СтрДок.ДокументНомер));  
					 
					СтрокиДок = ТаблицаДокПеречень.НайтиСтроки(ОтборДок);
					Если НЕ СтрокиДок.Количество() = 0 Тогда 
						НоваяСтр.ПаспортЛомбарды = СтрДок.Наименование; 
						СтрД = СтрокиДок.Получить(0);
						ПаспортП = "";    
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.Наименование), "", ?(ПустаяСтрока(ПаспортП), "", " ") + СокрЛП(СтрД.Наименование));
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.ДокументСерия), "", ?(ПустаяСтрока(ПаспортП), "", " серия ") + СокрЛП(СтрД.ДокументСерия)); 
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.ДокументНомер), "", ?(ПустаяСтрока(ПаспортП), "", " № ") + СокрЛП(СтрД.ДокументНомер)); 
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.ДокументКемВыдан), "", ?(ПустаяСтрока(ПаспортП), "", " выдан ") + СокрЛП(СтрД.ДокументКемВыдан)); 
						ПаспортП = ПаспортП + ?(СтрД.ДокументДатаВыдачи = Дата(1,1,1), "", ?(ПустаяСтрока(ПаспортП), "", " дата выдачи ") + Формат(СтрД.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy"));
						НоваяСтр.ПаспортПеречень = ПаспортП;
						ЕстьРезультат = истина; 
						НоваяСтр.РезультатПаспорт = "Совпадает";
						Прервать;
					КонецЕсли;	 
				КонецЦикла;	
				Если НЕ ЕстьРезультат Тогда  
					ПаспортаЛ = "";
					Для каждого СтрДок Из ТаблицаДокЛомбарды Цикл
						ПаспортаЛ = ?(ПустаяСтрока(ПаспортаЛ), "", Символы.ПС) + СтрДок.Наименование;						
					КонецЦикла;	 
					НоваяСтр.ПаспортЛомбарды = ПаспортаЛ;  
					ПаспортаП = ""; 
					Для каждого СтрД Из ТаблицаДокПеречень Цикл
						ПаспортП = "";    
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.Наименование), "", ?(ПустаяСтрока(ПаспортП), "", " ") + СокрЛП(СтрД.Наименование));
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.ДокументСерия), "", ?(ПустаяСтрока(ПаспортП), "", " серия ") + СокрЛП(СтрД.ДокументСерия)); 
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.ДокументНомер), "", ?(ПустаяСтрока(ПаспортП), "", " № ") + СокрЛП(СтрД.ДокументНомер)); 
						ПаспортП = ПаспортП + ?(ПустаяСтрока(СтрД.ДокументКемВыдан), "", ?(ПустаяСтрока(ПаспортП), "", " выдан ") + СокрЛП(СтрД.ДокументКемВыдан)); 
						ПаспортП = ПаспортП + ?(СтрД.ДокументДатаВыдачи = Дата(1,1,1), "", ?(ПустаяСтрока(ПаспортП), "", " дата выдачи ") + Формат(СтрД.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy"));
						ПаспортаП = ?(ПустаяСтрока(ПаспортП), "", Символы.ПС) +  ПаспортП;
					КонецЦикла; 
					НоваяСтр.ПаспортПеречень = ПаспортаП;
					НоваяСтр.РезультатПаспорт = "Не совпадает";
				КонецЕсли;	 
			КонецЦикла;
			
			Отбор = Новый Структура;
			Отбор.Вставить("Клиент", СтрК.Клиент);
			Строки = Отчет.ТаблицаСверки.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 Тогда 
				Стр = Строки.Получить(0);
				ОбластьСтрока.Параметры.ФИОЛомбарды = Стр.ФИОЛомбарды; 
				ОбластьСтрока.Параметры.ФИОПеречень = Стр.ФИОПеречень;
				ОбластьСтрока.Параметры.РезультатФИО = Стр.РезультатФИО; 
				
				ОбластьСтрока.Параметры.ДРЛомбарды = Стр.ДРЛомбарды;
				ОбластьСтрока.Параметры.ДРПеречень = Стр.ДРПеречень;
				ОбластьСтрока.Параметры.РезультатДР = Стр.РезультатДР;
				
				ОбластьСтрока.Параметры.МРЛомбарды = Стр.МРЛомбарды; 
				ОбластьСтрока.Параметры.МРПеречень = Стр.МРПеречень;
				ОбластьСтрока.Параметры.РезультатМР = Стр.РезультатМР; 
				
				ОбластьСтрока.Параметры.ПаспортЛомбарды = Стр.ПаспортЛомбарды;
				ОбластьСтрока.Параметры.ПаспортПеречень = Стр.ПаспортПеречень;
				ОбластьСтрока.Параметры.РезультатПаспорт = Стр.РезультатПаспорт;

				ОбластьСтрока.Параметры.АдресЛомбарды = Стр.АдресЛомбарды; 
				ОбластьСтрока.Параметры.АдресПеречень = Стр.АдресПеречень; 
				ОбластьСтрока.Параметры.РезультатАдрес = Стр.РезультатАдрес;
				
				ОбластьСтрока.Параметры.СписокПроверок = Стр.СписокПроверок;
			КонецЕсли;	
			ДокументРезультат.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;	
	
	ОбластьПодвал.Параметры.Ответственный = Пользователи.ТекущийПользователь(); 
	ДокументРезультат.Вывести(ОбластьПодвал); 
	
КонецПроцедуры
